curd/app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "qq"], ["description", "123"], ["created_at", "2017-09-08 03:38:55.968024"], ["updated_at", "2017-09-08 03:38:55.968024"]]

  def update
    if @event.update(event_params)
---
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "dddd"], ["updated_at", "2017-09-08 04:05:52.649014"], ["id", 2]]

  def index
    @events = Event.page(params[:page]).per(5)
---
SELECT  "events".* FROM "events" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"